"""
Пакет для настройки и использования логгера приложения.
"""

__version__ = '1.0.0'
__author__ = 'Roman Romanovskiy'

# --------------------------------------------------------

from async_mc_controller.logger.mc_logger import MCLogger

# --------------------------------------------------------

# Глобальный экземпляр логгера для использования во всём приложении
mc_logger = MCLogger()

# --------------------------------------------------------

__all__ = [
    'MCLogger',
    'mc_logger',
]

# --------------------------------------------------------